       IDENTIFICATION DIVISION.   
       PROGRAM-ID. Hello.         
                                  
       ENVIRONMENT DIVISION.      
       CONFIGURATION SECTION.     
       INPUT-OUTPUT SECTION.      
                                  
       DATA DIVISION.             
       FILE SECTION.              
       WORKING-STORAGE SECTION.   
       LINKAGE SECTION.           
                                  
       PROCEDURE DIVISION.        
           DISPLAY "Hello world!".
           STOP RUN.              